#------=====================Задача 7 (1/10)=======================------
#Дано положительное двузначное число. Найдите число десятков в нем.
#>*Вводится единственное число (гарантируется, что оно соответствует условию #задачи).
N = int(input('Введіть число-->'))
print(N//10)