#------====================Задача 19 (5/10)#======================------
#Даны два момента времени в пределах одних и тех же суток. Для #каждого момента указан час, минута и секунда. Известно, что #второй момент времени наступил не раньше первого.
#Определите сколько секунд прошло между двумя моментами #времени.
#
#>*Программа на вход получает шесть целых чисел через перевод #строки. Первые три целых числа соответствуют часам, минутам и #секундам первого момента, следующие три числа соответствуют #второму моменту.
#Часы задаются числом от 0 до 23 включительно. Минуты и #секунды — от 0 до 59.

sek = int(input("Введіть кількість секкунд--)"))
minuts = int(input("Введіть кількість хвилини--)"))
hours = int(input("Введіть кількість години--)"))

first_time = sek + (minuts * 60) + (hours * 3600)

sekk = int(input("Введіть кількість секкунд--)"))
minutsk = int(input("Введіть кількість хвилини--)"))
hoursk = int(input("Введіть кількість години--)"))

second_time = sek + (minuts * 60) + (hours * 3600)

if first_time < second_time:
	total_time_result = second_time - first_time
	print("Різниця в сикундах складає", total_time_result)
