#------=====================Задача 5 (1/10)=======================------
#Напишите программу, которая будет возводить 2-ку в степень, которая была #введена пользователем:
#>* Вводится целое неотрицательное число N (N≤100).
#Вывод: 2 в степени N
N = int(input("Степінь 2-->"))
print(2**N)