#------=====================Задача 6 (2/10)=======================------
#Дано натуральное число. Выведите его последнюю цифру.
#>* Вводится единственное целое положительное число (гарантируется, что оно не #превышает 10000).
N = int(input('Введіть число-->'))
print(N % 10)