#------=====================Задача 2 (4/10)#=======================------
#Напишите программу, которая по данному числу N от 1 до 9 выводит на #экран N пингвинов. Изображение одного пингвина имеет размер 5×9 #символов, между двумя соседними пингвинами также имеется пустой (из #пробелов) столбец. Разрешается вывести пустой столбец после #последнего пингвина. Для упрощения рисования скопируйте пингвина из #примера в среду разработки.
#   _~_   
#  (o o)  
# /  V  \ 
#/(  _  )\
#  ^^ ^^   
#Примечания к задаче 2:
#- Не нужно проверять ограничения входных данных: условно, что все #введенные данные корректны и соответствуют условию. Т. е. например в #этой задаче введенное число N точно будет не меньше 1 и не больше 9.
#- Учтите, что вывод данных на экран производится построчно, а не #попингвинно.
#- Не забудьте, что для вывода бекслеша надо написать два бекслеша #подряд.
#- Эта задача относительно сложная. Вы можете пока что ее пропустить, #и вернуться позже.
penguis = int(input('Введіть кількість пінгвінів що записались до воєнкомату::-'))
arms = 1
print("Ми йдемо на бабакова приєднуйся до нас солдате")
while arms <= (penguis // 5):
  print("   _~_   " * 5);
  print("  (o o)  " * 5);
  print(" /  V  \\ " * 5);
  print('/(  _  )\\' * 5);
  print("  ^^ ^^  " * 5);
  arms +=1
print("   _~_   "* (penguis % 5));
print("  (o o)  "* (penguis % 5));
print(" /  V  \\ "* (penguis % 5));
print('/(  _  )\\'* (penguis % 5));
print("  ^^ ^^  "* (penguis % 5));



print("Наша ціль")

print("До атаки") 
print("""
************::::::::::::::::::-----------------
*************::::::*==%%=+:::------------------
:::********:::**=%%%%@%%%=%@%+-------------:::-
::::::::::::::%@%%@%=++**:::===+-------::::::::
:::::::::::::@%%%%++++**:::-:==+*------::::::::
-:::::::::::+%@@%=+++***=%=*::%*=:::::*:::-----
::::::::::::+@#@%%===%=:%%=*:-=+:--------------
:::::::::::::=@@%%=+=%=:::*::--:--------------:
::::::::::::::%%%=++=%%**+*:--------------:::**
**::::::::::::*%%%=*===+::::---::::::::********
********::::::::%%==+@%+::::--:****************
************:::::%%%===*::::::%****************
******+******::**%@@@%===+*::-%@@+:************
+************++###%%@%%%=*:::+@@@@@+***********
****++**++=#######@===%*::*=+@@@@@@%@#@@#%%****
+++++==############==*:*=%=+*#@@@@@@%##@#@@@%%+
%=%@###########@##@@%%=%@@@=%#@%#########@#@#%%
=@###########@####@@%@==%%=+##@@@@@#@######@@#%
%#############@#####=@==%%=@##@###%@#########@@
###############@####=@+==%@#####%%@#########@@@
###################%=@+=%%#####%##########@##@@
@##################@=#+=%####@#@@%%%@=%=+@@####
+*##################%#=%%##%@###@@%+*%%=*:=+@##
+*:#################=%@@##@@####@@%+*:==*:::%##
+***@##############%=%@##@#######@=+*+%@=+::+##
%%=**@#############%%%##########%%%=*:**=%=+*@#
%#@==*#############%%%@########@+**:----:*@%=+%

""")

print("Після атаки")

print("HP Бабакова =", (100-penguis*4))
print("    .--,       .--,        ")
print("   (`(``\.---./``)`)       ")
print("    ''._/o```o\_.''        ")
print("       (=``^``=)           ")
print("        >``–``<            ")
print("       /```````\           ")
print("      //'``````\\          ")
print("     //|````.```\\         ")
print("     "'\'````` /'"_.-~^`'-.")
print("        \``````/           ")
print("         )`(`)`(           ")
print("      (((__||__)))         ")