#------====================Задача 20 (2/10)#======================------
#За день машина проезжает N километров. Сколько дней нужно, #чтобы проехать маршрут длиной M километров?
#>*Программа получает на вход числа N и M (целые, #положительные).
N = int(input("Введіть кількість кілометрів що автомобіль поїжджає за день--)"))
M = int(input("Введіть довжину маршруту--)"))
print(f'Необхідно {M / N} днів')