#------==================Задача 3 (2/10)#====================------
#Дано положительное действительное число X. Выведите его #дробную часть.
#
#Формат ввода
#Вводится положительное действительное число.
#
#Формат вывода
#Выведите ответ на задачу.
set = float(input("Введіть додатнє дробове число"))
flo = set % 1
print(flo)
